# Последовательности list/tuple/str/range
# Контейнеры dict/set
# Словарь по умолчанию итерируется по ключам (keys)
# items - по кортежам
# values - по значениям

for mane in ...: #...- это инерируемый объект, то по чему мы проходим (любая последовательность)
    pass

#---- функции стандартной библиотеки
https://docs.python.org/3/library/functions.html

#---- функции зашитой библиотеки  - это методы


# Comprehension - это запись циклов в одну строку

'''
ДЗ
2 цикл

3 игра скрабл
подаётся одно слово, заранее ивестен алфавит
вычисляем вес и суммируем
можно использовать словар
'''
